Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.141/PIC32CM-LS60/edc/PIC32CM2532LS60064.PIC
      <edc:AdjustPoint edc:_addr="0x40001041" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001044" edc:access="------------nnnn----nnnnnnnnnnnn" edc:cname="DPLLRATIO" edc:impl="0xF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LDR" edc:desc="Loop Divider Ratio" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LDRFRAC" edc:desc="Loop Divider Ratio Fractional Part" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001048" edc:access="-----nnnnnnnnnnn---n-nnn--nnnnnn" edc:cname="DPLLCTRLB" edc:impl="0x7FF173F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Proportional Integral Filter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default Filter Mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LBFILT" edc:desc="Low Bandwidth Filter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="HBFILT" edc:desc="High Bandwidth Filter" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HDFILT" edc:desc="High Damping Filter" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPEN" edc:desc="Low-Power Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WUF" edc:desc="Wake Up Fast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:desc="Reference Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K Clock Reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC Clock Reference" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK Clock Reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LTIME" edc:desc="Lock Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="No time-out. Automatic lock" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="8MS" edc:desc="Time-out if no lock within 8 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="9MS" edc:desc="Time-out if no lock within 9 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="10MS" edc:desc="Time-out if no lock within 10 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="11MS" edc:desc="Time-out if no lock within 11 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:desc="Lock Bypass" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Clock Divider" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000104C" edc:access="------nn" edc:cname="DPLLPRESC" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="Output Clock Prescaler" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="DPLL output is divided by 1" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="DPLL output is divided by 2" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="DPLL output is divided by 4" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000104D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001050" edc:access="----rrr-" edc:cname="DPLLSYNCBUSY" edc:impl="0xE" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DPLL Enable Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:desc="DPLL Loop Divider Ratio Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLPRESC" edc:desc="DPLL Prescaler Synchronization Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001051" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001054" edc:access="------rr" edc:cname="DPLLSTATUS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="DPLL Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:desc="DPLL Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001055" edc:offset="0x3AB"/>
      <edc:SFRDef edc:_addr="0x40001400" edc:access="-----------------------------n-n" edc:cname="INTENCLR" edc:impl="0x5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
